[
    {
      "id":"asvgsr",
      "name": "Jane Smith",
      "years_of_experience": 15,
      "num_recipes": 75,
      "likes": 1000,
      "picture": "https://i.ibb.co/sQTpPW5/portrait-happy-male-chef-dressed-uniform.jpg",
      "bio": "Jane Smith is a classically trained chef with over 15 years of experience. She has worked in Michelin-starred restaurants and has a passion for creating simple yet delicious dishes using fresh, seasonal ingredients.",
      "recipes": [
        {
          "recipe_name": "Pan-Seared Scallops",
          "ingredients": [
            "8 large scallops",
            "2 tbsp butter",
            "1 clove garlic",
            "1 tbsp chopped parsley",
            "1 lemon"
          ],
          "cooking_method": "Season the scallops with salt and pepper. Melt the butter in a pan and add the minced garlic. Sear the scallops for 2-3 minutes on each side until golden brown. Sprinkle with chopped parsley and squeeze lemon juice over the top.",
          "rating": 4.8
        },
        {
          "recipe_name": "Chicken Piccata",
          "ingredients": [
            "4 chicken breasts",
            "1/2 cup flour",
            "2 tbsp butter",
            "2 tbsp olive oil",
            "1/2 cup chicken broth"
          ],
          "cooking_method": "Season the chicken breasts with salt and pepper. Dredge in flour and shake off excess. Heat the butter and olive oil in a pan and sauté the chicken until golden brown on both sides. Add the chicken broth and bring to a boil. Reduce heat and simmer for 5-10 minutes until the sauce thickens.",
          "rating": 4.5
        },
        {
          "recipe_name": "Pasta Carbonara",
          "ingredients": [
            "1 lb spaghetti",
            "1/2 lb pancetta",
            "4 egg yolks",
            "1 cup grated Parmesan cheese",
            "1 clove garlic"
          ],
          "cooking_method": "Cook the spaghetti in salted water until al dente. Reserve 1 cup of pasta water. In a pan, cook the pancetta until crispy. Add minced garlic and sauté for 1 minute. In a bowl, whisk together egg yolks and grated Parmesan cheese. Drain the pasta and add to the pancetta. Remove from heat and quickly mix in the egg mixture, adding reserved pasta water as needed to create a creamy sauce.",
          "rating": 4.7
        }
      ]
    },
  
    {
      "id":"afrhjg",
      "name": "Chef John",
      "years_of_experience": 25,
      "num_recipes": 500,
      "likes": 20000,
      "picture": "https://i.ibb.co/HhpFMPj/chef-blowing-smoke-from-pan.jpg",
      "bio": "Chef John is a professional chef with over 25 years of experience. He is known for his entertaining and educational cooking videos on YouTube, where he shares his passion for cooking with a global audience.",
      "recipes": [
        {
          "recipe_name": "Garlic Shrimp",
          "ingredients": [
            "1 lb large shrimp",
            "4 cloves garlic",
            "1/4 cup olive oil",
            "1 tbsp lemon juice",
            "1 tbsp chopped parsley"
          ],
          "cooking_method": "In a pan, heat olive oil and minced garlic over medium heat. Add the shrimp and cook for 2-3 minutes on each side until pink. Add lemon juice and chopped parsley, and stir to combine.",
          "rating": 4.9
        },
        {
          "recipe_name": "Beef Stroganoff",
          "ingredients": [
            "1 lb beef sirloin",
            "1 onion",
            "1 cup sliced mushrooms",
            "1 cup beef broth",
            "1/2 cup sour cream"
          ],
          "cooking_method": "Cut the beef into thin strips. In a pan, sauté sliced onions and mushrooms until tender. Add the beef and cook until browned. Add beef broth and simmer for 10-15 minutes. Remove from heat and stir in sour cream. Serve over egg noodles.",
          "rating": 4.9
        },
        {
          "recipe_name": "Spinach and Feta Stuffed Chicken",
          "ingredients": [
            "4 chicken breasts",
            "2 cups fresh spinach",
            "1/2 cup crumbled feta cheese",
            "1 tbsp minced garlic",
            "1 tbsp olive oil"
          ],
          "cooking_method": "Preheat oven to 375°F. Cut a pocket in the side of each chicken breast. Mix together spinach, feta, garlic, and olive oil. Stuff the chicken with the mixture and secure with toothpicks. Bake for 20-25 minutes until cooked through.",
          "rating": 4.3
        }
      ]
    },
  
    {
      "id":"frjig",
      "name": "Emily Johnson",
      "picture":"https://i.ibb.co/F4x96p6/Emely-jonson.jpg",
      "years_of_experience": 10,
      "num_recipes": 50,
      "likes": 500,
      "bio": "Emily Johnson is a professional chef who specializes in vegan cuisine. She has a decade of experience in the culinary industry and is passionate about creating healthy and delicious plant-based dishes.",
      "recipes": [
        {
          "recipe_name": "Vegan Pad Thai",
          "ingredients": [
            "8 oz rice noodles",
            "2 cups mixed vegetables",
            "1/4 cup peanut butter",
            "1/4 cup soy sauce",
            "2 tbsp lime juice"
          ],
          "cooking_method": "Cook rice noodles according to package directions. In a pan, stir-fry mixed vegetables. In a bowl, whisk together peanut butter, soy sauce, and lime juice. Add cooked noodles and sauce to the pan with vegetables and stir-fry for 1-2 minutes.",
          "rating": 4.7
        },
        {
          "recipe_name": "Vegan Cauliflower Fried Rice",
          "ingredients": [
            "2 cups cauliflower rice",
            "1 cup mixed vegetables",
            "1 tbsp vegetable oil",
            "1 tbsp soy sauce",
            "2 cloves garlic"
          ],
          "cooking_method": "In a pan, heat vegetable oil over medium heat. Add garlic and stir-fry for 30 seconds. Add mixed vegetables and cauliflower rice, stir-fry for 2-3 minutes. Add soy sauce and stir-fry for 1-2 more minutes.",
          "rating": 4.5
        },
        {
          "recipe_name": "Vegan Lentil Soup",
          "ingredients": [
            "1 cup red lentils",
            "1 onion",
            "2 carrots",
            "2 celery stalks",
            "4 cups vegetable broth"
          ],
          "cooking_method": "In a pot, sauté onion, carrots, and celery until soft. Add lentils and vegetable broth. Bring to a boil, reduce heat, and simmer for 20-25 minutes until lentils are tender.",
          "rating": 4.3
        }
      ]
    },
  
    {
      "id":"ginftd",
      "name": "Sarah Johnson",
      "years_of_experience": 12,
      "num_recipes": 50,
      "likes": 500,
      "picture": "https://i.ibb.co/gtHPnCv/woman-chef-cooking-vegetables-pan.jpg",
      "bio": "Sarah Johnson is a passionate chef with over 12 years of experience in creating delicious and healthy meals. She believes in using fresh ingredients to create nutritious and flavorful dishes that are perfect for any occasion.",
      "recipes": [
        {
          "recipe_name": "Grilled Chicken Salad",
          "ingredients": [
            "4 chicken breasts",
            "4 cups mixed greens",
            "1 avocado",
            "1/2 cup cherry tomatoes",
            "1/4 cup chopped red onion"
          ],
          "cooking_method": "Season chicken breasts with salt and pepper. Grill for 10-12 minutes until cooked through. Slice chicken and arrange on a bed of mixed greens. Top with sliced avocado, cherry tomatoes, and red onion. Serve with your favorite dressing.",
          "rating": 4.5
        },
        {
          "recipe_name": "Spinach and Feta Stuffed Chicken",
          "ingredients": [
            "4 chicken breasts",
            "2 cups fresh spinach",
            "1/2 cup crumbled feta cheese",
            "1 tbsp minced garlic",
            "1 tbsp olive oil"
          ],
          "cooking_method": "Preheat oven to 375°F. Cut a pocket in the side of each chicken breast. Mix together spinach, feta, garlic, and olive oil. Stuff the chicken with the mixture and secure with toothpicks. Bake for 20-25 minutes until cooked through.",
          "rating": 4.3
        },
        {
          "recipe_name": "Roasted Vegetable Pasta",
          "ingredients": [
            "1 lb pasta",
            "2 cups mixed vegetables (zucchini, bell peppers, onion, etc.)",
            "2 tbsp olive oil",
            "1 tbsp minced garlic",
            "1/2 cup grated Parmesan cheese"
          ],
          "cooking_method": "Preheat oven to 400°F. Toss vegetables with olive oil and garlic. Roast for 20-25 minutes until tender. Cook pasta in salted water until al dente. Drain pasta and toss with roasted vegetables and Parmesan cheese.",
          "rating": 4.7
        }
      ]
    },
  
    {
      "id":"jiyebd",
      "name": "Mary Johnson",
      "years_of_experience": 12,
      "num_recipes": 80,
      "likes": 2500,
      "picture": "https://i.ibb.co/gvnDCXt/female-chef-holding-wooden-fork-spatula-white-uniform-looking-serious.jpg",
      "bio": "Mary Johnson is a chef who specializes in vegan and plant-based cuisine. She has over 12 years of experience and is passionate about creating healthy and delicious meals.",
      "recipes": [
        {
          "recipe_name": "Butternut Squash Soup",
          "ingredients": [
            "1 medium butternut squash",
            "1 large onion",
            "2 garlic cloves",
            "1 tbsp olive oil",
            "4 cups vegetable broth"
          ],
          "cooking_method": "Preheat oven to 400°F. Cut butternut squash in half and scoop out seeds. Brush olive oil on the cut side of the squash halves and place them cut-side down on a baking sheet. Bake for 40-45 minutes, or until the flesh is tender. In a large pot, sauté onion and garlic in olive oil until the onion is translucent. Scoop the butternut squash out of the skin and add to the pot. Add vegetable broth and bring to a boil. Reduce heat and simmer for 20-25 minutes. Blend the soup until smooth.",
          "rating": 4.9
        },
        {
          "recipe_name": "Vegan Stuffed Peppers",
          "ingredients": [
            "4 bell peppers",
            "1 cup cooked quinoa",
            "1 cup canned black beans",
            "1 cup corn",
            "1 tbsp chili powder"
          ],
          "cooking_method": "Preheat oven to 375°F. Cut the tops off the peppers and remove the seeds. In a bowl, mix together cooked quinoa, black beans, corn, and chili powder. Stuff the peppers with the mixture and place them in a baking dish. Cover with foil and bake for 30 minutes. Remove the foil and bake for an additional 10-15 minutes.",
          "rating": 4.7
        },
        {
          "recipe_name": "Vegan Pad Thai",
          "ingredients": [
            "8 oz rice noodles",
            "2 tbsp vegetable oil",
            "1 block extra-firm tofu",
            "2 garlic cloves",
            "1/4 cup peanut butter"
          ],
          "cooking_method": "Soak the rice noodles in hot water for 15-20 minutes until softened. Drain and set aside. In a pan, sauté cubed tofu in vegetable oil until golden brown. Add minced garlic and sauté for 1 minute. In a bowl, whisk together peanut butter, soy sauce, and lime juice. Add the noodles and sauce to the pan with the tofu and garlic. Cook until heated through, stirring constantly. Serve with chopped peanuts and lime wedges.",
          "rating": 4.6
        }
      ]
    },
    {
      "id":"oebiec",
      "name": "Gordon Ramsay",
      "years_of_experience": 30,
      "num_recipes": 150,
      "likes": 5000,
      "picture": "https://i.ibb.co/3pjyQTk/smiling-waiter-carrying-tray-salad-restaurant.jpg",
      "bio": "Gordon Ramsay is a British celebrity chef with over 30 years of experience. He has multiple Michelin stars and is known for his no-nonsense approach to cooking and hosting popular TV shows like 'Hell's Kitchen'.",
      "recipes": [
        {
          "recipe_name": "Beef Wellington",
          "ingredients": [
            "2 lb beef tenderloin",
            "1 lb puff pastry",
            "8 oz mushrooms",
            "2 tbsp Dijon mustard",
            "1 egg"
          ],
          "cooking_method": "Season the beef with salt and pepper. Sear it on all sides in a pan. Let it cool. Chop the mushrooms and sauté them in a pan until they release their liquid. Add thyme and cook until the liquid evaporates. Roll out the puff pastry and spread the Dijon mustard on it. Place the beef on top and cover it with the mushrooms. Fold the pastry around the beef and brush it with beaten egg. Bake at 425°F for 40-50 minutes.",
          "rating": 4.9
        },
        {
          "recipe_name": "Lobster Risotto",
          "ingredients": [
            "1 lb lobster meat",
            "1 cup Arborio rice",
            "4 cups chicken stock",
            "1 cup white wine",
            "1/2 cup grated Parmesan cheese"
          ],
          "cooking_method": "Cook the Arborio rice in a pan with white wine until the wine is absorbed. Add chicken stock a little at a time, stirring constantly, until the rice is cooked. In another pan, sauté the lobster meat in butter until it's cooked through. Add the lobster meat and Parmesan cheese to the rice and stir until combined.",
          "rating": 4.7
        },
        {
          "recipe_name": "Sticky Toffee Pudding",
          "ingredients": [
            "1 cup dates",
            "1 cup boiling water",
            "1 tsp baking soda",
            "1 cup flour",
            "1 cup brown sugar"
          ],
          "cooking_method": "Soak the dates in boiling water for 30 minutes. Preheat the oven to 350°F. In a bowl, mix together the flour and brown sugar. Add the baking soda to the date mixture and mix well. Combine the date mixture with the flour mixture and stir until just combined. Pour the batter into a greased baking dish and bake for 30-35 minutes. Serve with warm toffee sauce.",
          "rating": 4.5
        }
      ]
    }
  ]
  